<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'بيانات الاعتماد هذه غير متطابقة مع سجلاتنا.',
    'password' => 'كلمة المرور التي تم إدخالها غير صحيحة.',
    'throttle' => 'عدد محاولات تسجيل الدخول كبير جداً. الرجاء المحاولة مرة أخرى خلال :seconds ثانية.',
    'logout' => 'تسجيل الخروج',

    'register' => [
        'page_title' => 'تسجيل',
        'title' => 'ابدأ المغامرة هنا 🚀',
        'subtitle' => 'اجعل إدارة تطبيقك سهلة وممتعة!',
        'have_account' => 'هل لديك حساب بالفعل؟',
        'actions' => [
            'submit' => 'إنشاء حساب',
            'login' => 'تسجيل الدخول بدلاً من ذلك',
            'login-note' => 'لديك حساب بالفعل؟',
        ],
        'attributes' => [
            'name' => 'الاسم',
            'email' => 'البريد الإلكتروني',
            'phone' => 'رقم الهاتف',
            'password' => 'كلمة المرور',
            'password_confirmation' => 'تأكيد كلمة المرور',
            'remember' => 'تذكرني',
        ],
    ],
    'login' => [
        'page_title' => 'تسجيل الدخول',
        'title' => 'مرحبًا بك في :app 👋',
        'subtitle' => 'يرجى تسجيل الدخول إلى حسابك وابدأ المغامرة',
        'actions' => [
            'submit' => 'تسجيل الدخول',
            'forget' => 'نسيت كلمة المرور',
            'register' => 'إنشاء حساب',
            'register-note' => 'ليس لديك حساب؟',
        ],
        'attributes' => [
            'email' => 'البريد الإلكتروني',
            'password' => 'كلمة المرور',
            'remember' => 'تذكرني',
        ],
    ],
    'forget_password' => [
        'page_title' => 'نسيت كلمة المرور',
        'title' => 'هل نسيت كلمة المرور؟ 🔒',
        'subtitle' => 'أدخل بريدك الإلكتروني وسنرسل لك تعليمات لإعادة تعيين كلمة المرور',
        'actions' => [
            'submit' => 'إرسال رابط إعادة التعيين',
            'login' => 'العودة لتسجيل الدخول',
        ],
        'attributes' => [
            'email' => 'البريد الإلكتروني',
        ],
    ],
    'reset_password' => [
        'page_title' => 'إعادة تعيين كلمة المرور',
        'title' => 'إعادة تعيين كلمة المرور 🔒',
        'for' => 'لـ',
        'actions' => [
            'submit' => 'تعيين كلمة مرور جديدة',
            'login' => 'العودة لتسجيل الدخول',
        ],
        'notifications' => [
            'otp' => 'كلمة المرور لمرة واحدة (OTP) الخاصة بك لاستعادة كلمة مرور :app هي :code وتنتهي صلاحيتها في :expireAt',
        ],
        'attributes' => [
            'email' => 'البريد الإلكتروني',
            'password' => 'كلمة المرور الجديدة',
            'password_confirmation' => 'تأكيد كلمة المرور',
        ],
    ],
    'verify_email' => [
        'page_title' => 'تأكيد البريد الإلكتروني',
        'title' => 'أكد بريدك الإلكتروني ✉️',
        'subtitle' => 'برجاء تأكيد بريدك الإلكتروني بالنقر على الرابط الذي أرسلناه لك؟ إذا لم يصلك البريد، سنقوم بإرسال رابط آخر.',
        'messages' => [
            'sent' => 'تم إرسال رابط تحقق جديد إلى عنوان البريد الإلكتروني الذي قدمته أثناء التسجيل.',
        ],
        'actions' => [
            'send' => 'إعادة إرسال رابط التحقق',
        ],
    ],
    'confirm_password' => [
        'page_title' => 'تأكيد كلمة المرور',
        'title' => 'تأكيد كلمة المرور 🔒',
        'subtitle' => 'هذه منطقة آمنة من التطبيق. الرجاء تأكيد كلمة المرور قبل المتابعة.',
        'actions' => [
            'submit' => 'تأكيد',
        ],
    ],
    'verify' => [
        'title' => 'تحقق من رقم الهاتف 💬',
        'sub-title' => 'أرسلنا رمز التحقق إلى هاتفك المحمول. أدخل الرمز من الهاتف في الحقل أدناه.',
        'attributes' => [
            'otp' => 'اكتب رمز الأمان المكون من 4 أرقام',
            'submit' => 'تحقق من حسابي',
        ],
        'actions' => [
            'resend-note' => 'لم تتلقَ الرمز؟',
            'resend' => 'إعادة إرسال',
            'logout-note' => 'أو سجل الدخول بحساب آخر',
            'logout' => 'تسجيل الخروج',
        ],
        'messages' => [
            'already-verified' => 'رقم هاتفك مُحقق بالفعل.',
            'sent' => 'أرسلنا رمز التحقق إلى هاتفك المحمول',
            'resent' => 'تم إعادة إرسال OTP بنجاح.',
        ],
        'notifications' => [
            'otp' => 'كلمة المرور لمرة واحدة (OTP) الخاصة بك لتسجيل :app هي :code وتنتهي صلاحيتها في :expireAt',
        ],
        'validation' => [
            'otp' => [
                'exists' => 'OTP غير صالح',
                'rate-limit' => 'يمكنك المحاولة مرة أخرى بعد :seconds ثانية.',
            ],
        ],
    ],
];
