<?php

return [
    'plural' => 'الفعاليات',
    'singular' => 'فعالية',
    'tracking' => 'الفعاليات',
    'tracking_note' => 'تتبع جميع الفعاليات في المملكة',
    'all' => 'الكل',
    'recently' => 'المضافة مؤخراً',
    'search' => 'بحث',
    'empty' => 'لا توجد فعاليات',
    'select' => 'اختر فعالية',
    'trashed' => 'الفعاليات المحذوفة',
    'perPage' => 'عدد النتائج في الصفحة',

    'actions' => [
        'list' => 'عرض الفعاليات',
        'show' => 'عرض الفعالية',
        'create' => 'إضافة فعالية جديدة',
        'new' => 'جديدة',
        'edit' => 'تعديل الفعالية',
        'delete' => 'حذف الفعالية',
        'delete_selected' => 'حذف الفعاليات المحددة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'save' => 'حفظ',
        'filter' => 'تصفية',
        'delete-account' => 'حذف الحساب',
        'avatar' => [
            'upload' => 'رفع صورة',
            'reset' => 'إعادة تعيين',
        ],
    ],

    'messages' => [
        'created' => 'تم إنشاء الفعالية بنجاح.',
        'updated' => 'تم تحديث الفعالية بنجاح.',
        'deleted' => 'تم حذف الفعالية بنجاح.',
        'restored' => 'تم استعادة الفعالية بنجاح.',
    ],

    'attributes' => [
        'name' => 'اسم الفعالية',
        'website' => 'الموقع الإلكتروني',
        'organizer_contact' => 'جوال المنظم',
        'description' => 'الوصف',
        'location' => 'موقع الفعالية',
        'lat' => 'خط العرض',
        'lng' => 'خط الطول',
        'city' => 'المدينة',
        'street' => 'الشارع',
        'district' => 'الحي',
        'full_address' => 'العنوان الكامل',
        'date' => 'التاريخ',
        'actions' => 'الإجراءات',
        'social_type' => 'نوع الوسيلة الاجتماعية',
        'social_link' => 'الرابط',
        'days' => 'الأيام',
        'day' => 'اليوم',
        'from' => 'من',
        'to' => 'إلى',
    ],


    'notes' => [
        'avatar' => 'الأنواع المسموح بها: JPG, JPEG, GIF أو PNG.',
    ],

    'dialogs' => [
        'delete' => [
            'title' => 'تنبيه!',
            'info' => 'هل أنت متأكد أنك تريد حذف هذه الفعالية؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
        'delete_selected' => [
            'title' => 'تنبيه!',
            'info' => '{1}هل أنت متأكد أنك تريد حذف الفعالية؟|{2}هل أنت متأكد أنك تريد حذف فعاليتين؟|[3,10]هل أنت متأكد أنك تريد حذف :count فعاليات؟|[11,*]هل أنت متأكد أنك تريد حذف :count فعالية؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
        'restore' => [
            'title' => 'تنبيه!',
            'info' => 'هل أنت متأكد أنك تريد استعادة هذه الفعالية؟',
            'confirm' => 'استعادة',
            'cancel' => 'إلغاء',
        ],
        'forceDelete' => [
            'title' => 'تنبيه!',
            'info' => 'هل أنت متأكد أنك تريد حذف الفعالية نهائياً؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'إلغاء',
        ],
    ],
];
